<template>
  <div style="width:50%">
    余幼时即嗜学。家贫，无从致书以观，每假借于藏书之家，手自笔录，计日以还。天大寒，砚冰坚，手指不可屈伸，弗之怠。录毕，走送之，不敢稍逾约。
   
<div class="div2" > <h1 >送东阳马生序</h1></div>
    <p>
      余幼时即嗜学。家贫，无从致书以观，每假借于藏书之家，手自笔录，计日以还。天大寒，砚冰坚，手指不可屈伸，弗之怠。录毕，走送之，不敢稍逾约。以是人多以书假余，余因得遍观群书。既加冠，益慕圣贤之道 ，又患无硕师、名人与游，尝趋百里外，从乡之先达执经叩问。先达德隆望尊，门人弟子填其室，未尝稍降辞色。余立侍左右，援疑质理，俯身倾耳以请；或遇其叱咄，色愈恭，礼愈至，不敢出一言以复；俟其欣悦，则又请焉。故余虽愚，卒获有所闻。当余之从师也，负箧曳屣行深山巨谷中，穷冬烈风，大雪深数尺，足肤皲裂而不知。至舍，四支僵劲不能动，媵人持汤沃灌，以衾拥覆，久而乃和。寓逆旅，主人日再食，无鲜肥滋味之享。同舍生皆被绮绣，戴朱缨宝饰之帽，腰白玉之环，左佩刀，右备容臭，烨然若神人；余则缊袍敝衣处其间，略无慕艳意。以中有足乐者，不知口体之奉不若人也。盖余之勤且艰若此。今虽耄老，未有所成，犹幸预君子之列，而承天子之宠光，缀公卿之后，日侍坐备顾问，四海亦谬称其氏名，况才之过于余者乎？今诸生学于太学，县官日有廪稍之供，父母岁有裘葛之遗，无冻馁之患矣；坐大厦之下而诵诗书，无奔走之劳矣；有司业、博士为之师，未有问而不告，求而不得者也；凡所宜有之书，皆集于此，不必若余之手录，假诸人而后见也。其业有不精，德有不成者，非天质之卑，则心不若余之专耳，岂他人之过哉！东阳马生君则，在太学已二年，流辈甚称其贤。余朝京师，生以乡人子谒余，撰长书以为贽，辞甚畅达，与之论辨，言和而色夷。自谓少时用心于学甚劳，是可谓善学者矣！其将归见其亲也，余故道为学之难以告之。谓余勉乡人以学者，余之志也；诋我夸际遇之盛而骄乡人者，岂知予者哉？

在这篇赠序里，作者叙述个人早年虚心求教和勤苦学习的经历，生动而具体地描述了自己借书求师之难，饥寒奔走之苦，并与太学生优越的条件加以对比，有力地说明学业能否有所成就，主要在于主观努力，不在天资的高下和条件的优劣，以勉励青年人珍惜良好的读书环境，专心治学。全文结构严谨，详略有致，用对比说理，在叙事中穿插细节描绘，读来生动感人。

全文分三大段。

第一段写自己青少年时代求学的情形，着意突出其“勤且艰”的好学精神。内中又分四个层次。第一层从借书之难写自己学习条件的艰苦。因家贫无书，只好借书、抄书，尽管天大寒，砚结冰，手指冻僵，也不敢稍有懈怠。第二层从求师之难，写虚心好学的必要。百里求师，恭谨小心。虽遇叱咄，终有所获。第三层从生活条件之难，写自己安于清贫，不慕富贵，因学有所得，故只觉其乐而不觉其苦，强调只要精神充实，生活条件的艰苦是微不足道的。第四层是这一段的总结。由于自己不怕各种艰难，勤苦学习，所以终于学有所成。虽然作者谦虚地说自己“未有所成”，但一代大儒的事实，是不待自言而人都明白的。最后“况才之过于余者乎”的反诘句承前启后，内容十分丰富。首先作者用反诘的语气强调了天分稍高的人若能像自己这样勤奋，必能取得越自己的卓绝成就。同时言外之意是说自己并不是天才，所以能取得现在的成绩，都是勤奋苦学的结果。推而言之，人若不是天资过分低下，学无所成，就只怪自己刻苦努力不够了。从下文知道，马生是一个勤奋好学的青年，他只要坚持下去，其前途也是不可限量的。所以这一句话虽寥寥数字，但含义深厚，作用大，既照应了上文，又关联了下文，扣紧了赠序的主题，把自己对马生的劝诫、勉励和期望，诚恳而又不失含蓄地从容道出，表现出“雍容浑穆”的大家风度。

第二段紧承第一段，写当代太学生学习条件的优越，与作者青年时代求学的艰难形成鲜明的对照，从反面强调了勤苦学习的必要性。“日有廪稍之供”云云是与上文生活条件之苦对比，“有司业、博士为之师”云云是与上文求师之难对比，“凡所宜有之书，皆集于此”云云，与上文借书之难对比。通过对比，人们很清楚地看出当今太学生在读书、求师、生活等几个方面，都比作者当年的求学条件优越得多，但却业有未精，德有未成。最后用一个选择句式又加一个反诘句式，强调指出：关键就在于这些太学生既不勤奋又不刻苦。这又是对上段第四层的照应。

以上两段从正反两个方面强调了勤苦学习的重要性，虽未明言是对马生的劝励，而劝励之意自明。然而文章毕竟是为马生而作的，所以至第三段便明确地写到马生，点明写序的目的，这就是“道为学之难”，“勉乡人以学者”。因为劝励的内容在上两段中已经写足，所以这里便只讲些推奖褒美的话，但是殷切款诚之意，马生是不难心领神会的。

宋濂为人宽厚诚谨，谦恭下人。此文也是一如其人，写得情辞婉转，平易亲切。其实按他的声望、地位，他完全可以摆出长者的架子，正面说理大发议论，把这个青年教训一通的。然而他却不这样做。他绝口不说你们青年应当怎样怎样，而只是说“我”曾经怎样怎样，自己放在与对方平等的地位上，用自己亲身的经历和切身的体会去和人谈心。不仅从道理上，而且从形象上、情感上去启发影响读者，使人感到在文章深处有一种崇高的人格感召力量，在阅读过程中，读者会在不知不觉中缩短了与作者思想上的距离，赞同他的意见，并乐于照着他的意见去做。写文章要能达到这一步，决非只是一个文章技巧问题，这是需要有深厚的思想修养作基础的。

其次，作者在说理上，也不是凭空论道，而是善于让思想、道理从事实的叙述中自然地流露出来。而在事实的叙述中，又善于将概括的述说与典型的细节描绘有机地结合起来，这就使文章具体实在，仅在行文上简练生动，而且还具有很强的说服力和感染力。例如在说到读书之难时，作者在概括地叙述了自己因家贫无书，不得不借书、抄书，计日以还的情形后说:“天大寒，砚冰坚，手指不可屈伸，弗之怠。”通过这样一个典型的细节描写，就使人对作者当初读书的勤奋及学习条件的艰苦，有了一个生动形象的具体感受。理在事中，而事颇感人。这也是此文使人乐于赞同并接受作者意见的又一个内在的原因。

而且，文章浑然天成，内在结构却十分严密而紧凑。本来文章所赠送的对象是一篇之主体。然而文章却偏把主体抛在一边，先从自己谈起，从容道来，由己及人，至最后才谈及赠送的对象。看似漫不经心，实则匠心独运。在文章的深层结构中，主宾之间有一种紧密的内在联系，时时针对着主，处处照应到主，而却避免了一般赠序文章直露生硬的缺点，使文章委婉含蓄，意味深长。在写作中又成功地运用了对比映衬的手法，使左右有对比，前后有照应，文章于宽闲中显示严整，“鱼鱼雅雅，自中节度”。这一点给人的印象也是十分深刻的。
    </p>
  </div>
</template>

<script>
export default {
 setup(props) {
   
 }
 
};
</script>

<style  scoped>
.div2{
  background-color: #fff;
  z-index: 10;
  height: 50px;
  position:sticky;
  top:0px;
  border-bottom: 1px solid #ccc;
}
</style>